////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ МЕТОДЫ

&НаСервере
Функция ОтветственноеЛицоОрганизации(ОтветственноеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ответственные.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&КонецПериода,
	|			СтруктурнаяЕдиница = &Организация
	|				И ОтветственноеЛицо = &ОтветственноеЛицо) КАК Ответственные";
	Запрос.УстановитьПараметр("Организация",	Отчет.Организация);
	Запрос.УстановитьПараметр("КонецПериода",	ТекущаяДата());
	//+ Корус консалтинг. Василенко С.Н. 09.06.2016 17:53:20
	Запрос.УстановитьПараметр("ОтветственноеЛицо",	ОтветственноеЛицо);
	//- Корус консалтинг. Василенко С.Н. 09.06.2016 17:53:20
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СпециалистПоУчету = Справочники.ФизическиеЛица.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		СпециалистПоУчету = Выборка.ФизическоеЛицо;
	КонецЕсли;
	
	Возврат СпециалистПоУчету;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииСсылки()
	
	//Отчет.Период			= Отчет.Ссылка.Дата;
	//Отчет.СпециалистПоУчету	= ОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.ГПН_СпециалистПоУчету);
	Отчет.ИнвентаризационнаяОпись = Отчеты.ГПН_ВедомостьНаличияНефтепродуктовВРезервуарах.ПоследняяОписьНаДатуОтчета(Отчет.СменныйОтчет);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь		= глЗначениеПеременной("глТекущийПользователь");
	Отчет.Организация	= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнаяОрганизация");
	Отчет.СпециалистПоУчету = ОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.ГПН_СпециалистПоУчету); 
	Отчет.ЗавСкладом		= ОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.ГПН_ЗаведующийСкладомНефтепродуктов); 
	
	//+ Корус консалтинг. Мочалов Ю.А. 08.07.2016 
	Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("Ссылка") Тогда
		Параметры.ЗначенияЗаполнения.Вставить("СменныйОтчет", Параметры.ЗначенияЗаполнения.Ссылка);
		Отчет.ИнвентаризационнаяОпись = Отчеты.ГПН_ВедомостьНаличияНефтепродуктовВРезервуарах.ПоследняяОписьНаДатуОтчета(Параметры.ЗначенияЗаполнения.Ссылка);		
	КонецЕсли;
	//- Корус консалтинг. Мочалов Ю.А. 08.07.2016 
	
	//+ Корус Консалтинг. Смирнов Н.Н. 20 апреля 2016 г. 14:26:30
	ГПН_ТерминалШиппингСервер.ЗаполнитьРеквизитыОтчетаПоПараметрамФормы(Отчет, Параметры);
	//- Корус Консалтинг. Смирнов Н.Н. 20 апреля 2016 г. 14:26:30

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)

	ГПН_ТерминалШиппингСервер.ЗаполнитьНастройкиПоПараметрамФормы(Отчет, Настройки,Параметры);

КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)

	ГПН_ТерминалШиппингСервер.ЗаполнитьПользовательскиеНастройкиПоПараметрамФормы(Отчет, Настройки, Параметры);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СсылкаПриИзменении(Элемент)
	
	ПриИзмененииСсылки();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПоказатьСкрытьНастройки(Команда)
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = НЕ Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость;
	
КонецПроцедуры